---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofMeetsRoofTangentiallyError
source: html/0d627ee2-ee2a-199d-90c9-dc0afca3bf94.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofMeetsRoofTangentiallyError Property

The roofs cannot be joined because the roof being joined meets the target roof tangentially.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoofMeetsRoofTangentiallyError { get; }
```